Tekla Open API Reference for Tekla Structures 2025
Beam.Type Property
 Gets the read-only type of the beam. The default type for a new beam instance is beam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Beam.BeamTypeEnum Type { get; }
Public ReadOnly Property Type As Beam.BeamTypeEnum
	Get
Property Value
Type: Beam.BeamTypeEnum
See Also
Reference
Beam Class
Tekla.Structures.Model Namespace